
--------------------------------------
#19 conv1d+lstm 64x64x128 non-parallel
--------------------------------------
Model
______________________________________________________________________________________________________________________
Layer (type)                                         Output Shape                                   Param #           
======================================================================================================================
conv1d_1 (Conv1D)                                    (None, None, 64)                               832               
______________________________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)                       (None, None, 64)                               0                 
______________________________________________________________________________________________________________________
conv1d_2 (Conv1D)                                    (None, None, 64)                               16448             
______________________________________________________________________________________________________________________
lstm_1 (LSTM)                                        (None, 128)                                    98816             
______________________________________________________________________________________________________________________
dense_1 (Dense)                                      (None, 1)                                      129               
======================================================================================================================
Total params: 116,225
Trainable params: 116,225
Non-trainable params: 0
______________________________________________________________________________________________________________________


----------------------------------
#20 conv1d+lstm 64x64x128 parallel
----------------------------------
Model
_____________________________________________________________________________________________________________
Layer (type)                       Output Shape            Param #       Connected to
=============================================================================================================
conv1d_1_input (InputLayer)        (None, None, 3)         0
_____________________________________________________________________________________________________________
lambda_1 (Lambda)                  (None, None, 3)         0             conv1d_1_input[0][0]
_____________________________________________________________________________________________________________
lambda_2 (Lambda)                  (None, None, 3)         0             conv1d_1_input[0][0]
_____________________________________________________________________________________________________________
sequential_1 (Sequential)          (None, 1)               116225        lambda_1[0][0]
                                                                         lambda_2[0][0]
_____________________________________________________________________________________________________________
dense_1 (Concatenate)              (None, 1)               0             sequential_1[1][0]
                                                                         sequential_1[2][0]
=============================================================================================================
Total params: 116,225
Trainable params: 116,225
Non-trainable params: 0
_____________________________________________________________________________________________________________
